{
    "all":"- Noun\n- Pronoun\n- Verb\n- Adjective\n- Adverb\n- Preposition\n- Conjunction\n- Interjection",
    "noun":"A noun is a word that names a person, place, thing, or idea. For example, cat, Paris, book, and freedom are nouns. Nouns can be classified into different types, such as:\n- Common nouns: These are nouns that refer to general or non-specific things. For example, city, dog, and flower are common nouns.\n- Proper nouns: These are nouns that refer to specific or unique things. They usually start with a capital letter. For example, London, Fido, and Rose are proper nouns.\n- Concrete nouns: These are nouns that refer to things that can be seen, touched, heard, smelled, or tasted. For example, table, music, and chocolate are concrete nouns.\n- Abstract nouns: These are nouns that refer to things that cannot be perceived by the senses. They usually refer to concepts, feelings, or ideas. For example, love, justice, and dream are abstract nouns.\n- Countable nouns: These are nouns that can be counted or have a plural form. For example, apple, book, and child are countable nouns. You can say one apple, two books, or three children.\n- Uncountable nouns: These are nouns that cannot be counted or have a plural form. For example, water, rice, and information are uncountable nouns. You cannot say one water, two rices, or three informations\n\n\nA noun is a word that names a person, place, thing, or idea. For example, cat, Paris, book, and freedom are nouns. Nouns can be classified into different types, such as:\n- Common nouns: These are nouns that refer to general or non-specific things. For example, city, dog, and flower are common nouns.\n- Proper nouns: These are nouns that refer to specific or unique things. They usually start with a capital letter. For example, London, Fido, and Rose are proper nouns.\n- Concrete nouns: These are nouns that refer to things that can be seen, touched, heard, smelled, or tasted. For example, table, music, and chocolate are concrete nouns.\n- Abstract nouns: These are nouns that refer to things that cannot be perceived by the senses. They usually refer to concepts, feelings, or ideas. For example, love, justice, and dream are abstract nouns.\n- Countable nouns: These are nouns that can be counted or have a plural form. For example, apple, book, and child are countable nouns. You can say one apple, two books, or three children.\n- Uncountable nouns: These are nouns that cannot be counted or have a plural form. For example, water, rice, and information are uncountable nouns. You cannot say one water, two rices, or three informations\n]n\nA noun is a word that names a person, place, thing, or idea. For example, cat, Paris, book, and freedom are nouns. Nouns can be classified into different types, such as:\n- Common nouns: These are nouns that refer to general or non-specific things. For example, city, dog, and flower are common nouns.\n- Proper nouns: These are nouns that refer to specific or unique things. They usually start with a capital letter. For example, London, Fido, and Rose are proper nouns.\n- Concrete nouns: These are nouns that refer to things that can be seen, touched, heard, smelled, or tasted. For example, table, music, and chocolate are concrete nouns.\n- Abstract nouns: These are nouns that refer to things that cannot be perceived by the senses. They usually refer to concepts, feelings, or ideas. For example, love, justice, and dream are abstract nouns.\n- Countable nouns: These are nouns that can be counted or have a plural form. For example, apple, book, and child are countable nouns. You can say one apple, two books, or three children.\n- Uncountable nouns: These are nouns that cannot be counted or have a plural form. For example, water, rice, and information are uncountable nouns. You cannot say one water, two rices, or three informations\n\n\nA noun is a word that names a person, place, thing, or idea. For example, cat, Paris, book, and freedom are nouns. Nouns can be classified into different types, such as:\n- Common nouns: These are nouns that refer to general or non-specific things. For example, city, dog, and flower are common nouns.\n- Proper nouns: These are nouns that refer to specific or unique things. They usually start with a capital letter. For example, London, Fido, and Rose are proper nouns.\n- Concrete nouns: These are nouns that refer to things that can be seen, touched, heard, smelled, or tasted. For example, table, music, and chocolate are concrete nouns.\n- Abstract nouns: These are nouns that refer to things that cannot be perceived by the senses. They usually refer to concepts, feelings, or ideas. For example, love, justice, and dream are abstract nouns.\n- Countable nouns: These are nouns that can be counted or have a plural form. For example, apple, book, and child are countable nouns. You can say one apple, two books, or three children.\n- Uncountable nouns: These are nouns that cannot be counted or have a plural form. For example, water, rice, and information are uncountable nouns. You cannot say one water, two rices, or three informations\n\n\nA noun is a word that names a person, place, thing, or idea. For example, cat, Paris, book, and freedom are nouns. Nouns can be classified into different types, such as:\n- Common nouns: These are nouns that refer to general or non-specific things. For example, city, dog, and flower are common nouns.\n- Proper nouns: These are nouns that refer to specific or unique things. They usually start with a capital letter. For example, London, Fido, and Rose are proper nouns.\n- Concrete nouns: These are nouns that refer to things that can be seen, touched, heard, smelled, or tasted. For example, table, music, and chocolate are concrete nouns.\n- Abstract nouns: These are nouns that refer to things that cannot be perceived by the senses. They usually refer to concepts, feelings, or ideas. For example, love, justice, and dream are abstract nouns.\n- Countable nouns: These are nouns that can be counted or have a plural form. For example, apple, book, and child are countable nouns. You can say one apple, two books, or three children.\n- Uncountable nouns: These are nouns that cannot be counted or have a plural form. For example, water, rice, and information are uncountable nouns. You cannot say one water, two rices, or three informations",
    "pronoun":"A pronoun is a word that takes the place of a noun or another pronoun. For example, she, it, they, and mine are pronouns. Pronouns can be classified into different types, such as:\n\n- Personal pronouns: These are pronouns that refer to specific persons or things. They have different forms depending on the number, person, gender, and case of the noun they replace. For example, I, you, he, she, it, we, they, me, him, her, us, and them are personal pronouns.\n- Possessive pronouns: These are pronouns that show ownership or belonging. They have different forms depending on the number, person, gender, and case of the noun they replace. For example, my, your, his, her, its, our, their, mine, yours, his, hers, ours, and theirs are possessive pronouns.\n- Reflexive pronouns: These are pronouns that end with -self or -selves and refer back to the subject of the sentence or clause. They are used to emphasize the subject or to show that the subject performs an action on itself. For example, myself, yourself, himself, herself, itself, ourselves, yourselves, and themselves are reflexive pronouns.\n- Demonstrative pronouns: These are pronouns that point to specific persons or things. They have different forms depending on the number and distance of the noun they replace. For example, this, that, these, and those are demonstrative pronouns.\n- Interrogative pronouns: These are pronouns that are used to ask questions. They have different forms depending on the type of information they seek. For example, who, whom, what, which, and whose are interrogative pronouns.\n- Relative pronouns: These are pronouns that are used to introduce subordinate clauses that modify a noun or a pronoun. They have different forms depending on the number, person, gender, and case of the noun they replace. For example, who, whom, which, that, and whose are relative pronouns.\n- Indefinite pronouns: These are pronouns that refer to unspecified persons or things. They have different forms depending on the number and gender of the noun they replace. For example, someone, anyone, everyone, no one, something, anything, everything, nothing, some, any, all, none, and many are indefinite pronouns.",
    "verb":"A verb is a word that shows an action, a state, or an occurrence in a sentence. There are many rules for using verbs in English, but here are some of the most common ones:\n- Verbs have different forms depending on the tense, aspect, mood, and voice of the sentence. For example, the verb walk can have different forms like walks, walked, walking, is walking, has walked, will walk, can walk, is walked, etc.\n- Verbs agree with their subjects in number and person. This means that singular subjects have singular verbs, and plural subjects have plural verbs. For example, he walks but they walk. Similarly, first person subjects have first person verbs, second person subjects have second person verbs, and third person subjects have third person verbs. For example, I walk, you walk, and he walks.\n- Verbs can be either regular or irregular. Regular verbs follow a predictable pattern of adding -ed or -ing to form the past tense and the present participle. For example, walk becomes walked and walking. Irregular verbs do not follow this pattern and have different forms for the past tense and the present participle. For example, sing becomes sang and singing.\n- Verbs can be either transitive or intransitive. Transitive verbs take an object to complete their meaning. For example, she reads a book. Intransitive verbs do not take an object and can stand alone. For example, he sleeps.\n- Verbs can be either active or passive. Active verbs show that the subject performs the action. For example, she writes a letter. Passive verbs show that the subject receives the action. For example, a letter is written by her.- Verbs can be either finite or non-finite. Finite verbs show the tense, number, and person of the sentence. For example, she walks. Non-finite verbs do not show these features and are usually used with other verbs. For example, she likes walking.These are some of the basic rules of verbs in English.",
    "adjective":"An adjective is a word that modifies or describes a noun or a pronoun. For example, big, red, and beautiful are adjectives. Adjectives can be classified into different types, such as:\n\n- Descriptive adjectives: These are adjectives that describe the quality, size, shape, color, or appearance of a noun or a pronoun. For example, tall, round, blue, and pretty are descriptive adjectives.\n- Comparative adjectives: These are adjectives that compare two or more nouns or pronouns. They usually end with -er or are preceded by more or less. For example, bigger, more round, less blue, and prettier are comparative adjectives.\n- Superlative adjectives: These are adjectives that show the highest or lowest degree of comparison among three or more nouns or pronouns. They usually end with -est or are preceded by most or least. For example, biggest, most round, least blue, and prettiest are superlative adjectives.\n - Possessive adjectives: These are adjectives that show ownership or belonging. They have the same forms as the possessive pronouns, except that they are used before a noun. For example, my, your, his, her, its, our, and their are possessive adjectives.",
    "adverb":"An adverb is a word that modifies or describes a verb, an adjective, or another adverb. For example, quickly, very, and well are adverbs. Adverbs can be classified into different types, such as:\n\n- Adverbs of manner: These are adverbs that answer the question how something is done. They usually describe the way an action is performed. For example, slowly, carefully, and loudly are adverbs of manner.\n- Adverbs of time: These are adverbs that answer the question when something happens. They usually describe the time or duration of an action or event. For example, yesterday, soon, and always are adverbs of time.\n- Adverbs of place: These are adverbs that answer the question where something happens. They usually describe the location or direction of an action or event. For example, here, there, and upstairs are adverbs of place.\n- Adverbs of frequency: These are adverbs that answer the question how often something happens. They usually describe the frequency or regularity of an action or event. For example, never, sometimes, and often are adverbs of frequency.\n- Adverbs of degree: These are adverbs that answer the question how much or to what extent something happens. They usually modify an adjective or another adverb and show the intensity or degree of a quality or manner. For example, very, too, and enough are adverbs of degree.",
    "preposition":"A preposition is a word that shows the relationship between a noun or a pronoun and another word in the sentence. For example, in, on, and under are prepositions. Prepositions can be classified into different types, such as:\n\n- Prepositions of place: These are prepositions that indicate the position or location of something. For example, at, in, and on are prepositions of place. You can say at the park, in the room, or on the table.\n- Prepositions of time: These are prepositions that indicate the time or duration of something. For example, at, in, and for are prepositions of time. You can say at noon, in July, or for two hours.\n- Prepositions of direction: These are prepositions that indicate the movement or direction of something. For example, to, from, and towards are prepositions of direction. You can say to the store, from the airport, or towards the sun.\n- Prepositions of manner: These are prepositions that indicate the way or method of doing something. For example, by, with, and without are prepositions of manner. You can say by car, with a spoon, or without a doubt.\n- Prepositions of agent: These are prepositions that indicate the person or thing that performs an action. For example, by and from are prepositions of agent. You can say by John or from the teacher.",
    "conjunction":"A conjunction is a word that connects words, phrases, clauses, or sentences. For example, and, but, and because are conjunctions. Conjunctions can be classified into different types, such as:\n- Coordinating conjunctions: These are conjunctions that join two or more words, phrases, clauses, or sentences of equal importance or rank. They are usually placed between the elements they connect. For example, and, but, or, nor, for, yet, and so are coordinating conjunctions. You can use the acronym FANBOYS to remember them. You can say I like apples and oranges, She is smart but lazy, or He can sing or dance.\n- Subordinating conjunctions: These are conjunctions that join a dependent clause to an independent clause. They are usually placed at the beginning of the dependent clause. For example, because, although, if, when, since, and while are subordinating conjunctions. You can say Because it was raining, we stayed home, Although he is rich, he is not happy, or If you study hard, you will pass the exam.\n- Correlative conjunctions: These are pairs of conjunctions that work together to join two or more words, phrases, clauses, or sentences of equal importance or rank. They are usually placed around the elements they connect. For example, both...and, either...or, neither...nor, not only...but also, and whether...or are correlative conjunctions. You can say Both John and Mary are my friends, You can either stay or leave, or Not only is he smart, but also handsome",
    "interjunction":"An interjection is a word that expresses a sudden emotion or feeling. For example, wow, ouch, and yay are interjections. Interjections can be classified into different types, such as:\n\n- Primary interjections: These are interjections that have no other function or meaning in the language. They are usually used to convey a strong or spontaneous reaction. For example, ah, ugh, and oops are primary interjections. You can say Ah, that feels good, Ugh, I hate this, or Oops, I dropped it.\n- Secondary interjections: These are interjections that are derived from other parts of speech, such as nouns, verbs, adjectives, or exclamations. They are usually used to add emphasis or tone to a statement. For example, bravo, hello, and great are secondary interjections. You can say Bravo, you did a wonderful job, Hello, nice to meet you, or Great, I'm so happy for you."
}